openFoam3/openFOAM_3/mach-3-tunnel-with-step/sonicFoam30/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6.0
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          60;
        startFace       5280;
    }
    outlet
    {
        type            patch;
        nFaces          30;
        startFace       5340;
    }
    top
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          60;
        startFace       5370;
    }
    bottom
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          30;
        startFace       5430;
    }
    step
    {
        type            wall;
        inGroups        1(wall);
        nFaces          60;
        startFace       5460;
    }
    defaultFaces
    {
        type            empty;
        inGroups        1(empty);
        nFaces          5400;
        startFace       5520;
    }
)

// ************************************************************************* //
